app/controllers/api/players_controller.rb

SELECT "players".* FROM "players"
---
    def index
        render json: Player.all

SELECT "players".* FROM "players" WHERE "players"."id" = 1 LIMIT 1
---
    def show
        player = Player.find(params[:id])

SELECT "players".* FROM "players" WHERE "players"."name" = 'abcd' LIMIT 1
---
    def lookup
        player = Player.find_by(name: params[:name])

INSERT INTO "players" ("name", "pword", "rubies", "pickaxe", "fortune", "efficiency", "created_at", "updated_at") VALUES ('TestPlayer', 'be777e1c1380a74447b462723b7002240abd5f2714187f240c63699ba9810ee5', 0, 1, 0, 0, '2025-07-22 04:09:23.828579', '2025-07-22 04:09:23.828579') RETURNING "id"
---
    def create
        player = Player.new(player_params)
        if player.save

SELECT "players".* FROM "players" WHERE "players"."id" = 1 LIMIT 1
UPDATE "players" SET "efficiency" = 1, "updated_at" = '2025-07-22 07:46:16.231676' WHERE "players"."id" = 1
---
    def update
        player = Player.find(params[:id])
        if player.update(player_params)