app/controllers/api/players_controller.rb

    def update
        player = Player.find(params[:id])
        if player.update(player_params)
---
UPDATE "players" SET "rubies" = 17, "updated_at" = '2025-07-19 05:51:21.262847' WHERE "players"."id" = 1